GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
    uint16_t got = 0;
    if (rc == ESP_OK) {
        uint16_t ap_num = 0;
        esp_wifi_scan_get_ap_num(&ap_num);
        got = (ap_num > WIFI_SCAN_MAX) ? WIFI_SCAN_MAX : ap_num;
        /* Frees the whole internal AP list even when we ask for fewer. */
        esp_wifi_scan_get_ap_records(&got, recs);
    }

    xSemaphoreTake(s_scan_mutex, portMAX_DELAY);
    if (rc != ESP_OK) {
        s_scan_err   = rc;
        s_scan_state = SCAN_ERROR;
        ESP_LOGW(TAG, "Wi-Fi scan failed: %s", esp_err_to_name(rc));
    } else {
        const size_t cap = sizeof(s_scan_json);
        int n = snprintf(s_scan_json, cap, "[");
        for (uint16_t i = 0; i < got && n < (int)cap - 128; i++) {
            char ssid[64]; size_t sl = 0;   /* minimal JSON-string escape */
            for (size_t j = 0; recs[i].ssid[j] != 0 && j < sizeof(recs[i].ssid)
                               && sl < sizeof(ssid) - 2; j++) {
                char c = (char)recs[i].ssid[j];
                if (c == '"' || c == '\\') ssid[sl++] = '\\';
                ssid[sl++] = c;
            }
            ssid[sl] = '\0';
            n += snprintf(s_scan_json + n, cap - n,
                          "%s{\"ssid\":\"%s\",\"rssi\":%d,\"auth\":%d}",
                          i ? "," : "", ssid, (int)recs[i].rssi, (int)recs[i].authmode);
        }
        snprintf(s_scan_json + n, cap - n, "]");
        s_scan_done_us = esp_timer_get_time();
        s_scan_err     = ESP_OK;
        s_scan_state   = SCAN_DONE;
        ESP_LOGI(TAG, "Wi-Fi scan complete: %u AP(s)", (unsigned)got);
    }
    xSemaphoreGive(s_scan_mutex);
    vTaskDelete(nullptr);
}

/* Kick off a scan. Returns false only if one can't be started right now;
 * an already-running scan is reported as success so a second viewer clicking
 * Scan simply joins the one in flight rather than stacking radio work. */
extern "C" bool dns_sink_wifi_scan_start(void)
{
    if (!s_scan_mutex) return false;
    if (wifi_reconfig_active()) return false;   /* don't scan mid-reassociation */

    xSemaphoreTake(s_scan_mutex, portMAX_DELAY);
    if (s_scan_state == SCAN_RUNNING) { xSemaphoreGive(s_scan_mutex); return true; }
    s_scan_state = SCAN_RUNNING;
    xSemaphoreGive(s_scan_mutex);

    if (xTaskCreate(wifi_scan_task, "wifi_scan", 4096, nullptr, 3, nullptr) != pdPASS) {
        xSemaphoreTake(s_scan_mutex, portMAX_DELAY);
        s_scan_state = SCAN_ERROR;
        s_scan_err   = ESP_ERR_NO_MEM;
        xSemaphoreGive(s_scan_mutex);
        ESP_LOGE(TAG, "Wi-Fi scan task create failed");
        return false;
    }
    return true;
}

/* Read the cached result. Never blocks on the radio; bounded 200ms wait for
 * the (briefly-held) publish lock, reporting "busy" rather than stalling the
 * httpd task if it somehow can't be taken. */
extern "C" int dns_sink_wifi_scan_get(char *out, size_t cap)
{
    if (!s_scan_mutex)
        return snprintf(out, cap, "{\"state\":\"idle\",\"age_s\":-1,\"aps\":[]}");

    if (xSemaphoreTake(s_scan_mutex, pdMS_TO_TICKS(200)) != pdTRUE)
        return snprintf(out, cap, "{\"state\":\"scanning\",\"age_s\":-1,\"aps\":[]}");

    ScanState st = s_scan_state;
    int age = (st == SCAN_DONE && s_scan_done_us)
                ? (int)((esp_timer_get_time() - s_scan_done_us) / 1000000) : -1;
    int n;
    if (st == SCAN_DONE) {
        n = snprintf(out, cap, "{\"state\":\"done\",\"age_s\":%d,\"aps\":%s}", age, s_scan_json);
    } else if (st == SCAN_ERROR) {
        n = snprintf(out, cap, "{\"state\":\"error\",\"age_s\":-1,\"err\":\"%s\",\"aps\":[]}",
                     esp_err_to_name(s_scan_err));
    } else {
        n = snprintf(out, cap, "{\"state\":\"%s\",\"age_s\":-1,\"aps\":[]}", scan_state_name(st));
    }
    xSemaphoreGive(s_scan_mutex);
    return n;
}

/* The actual Wi-Fi teardown/reconnect, deferred a beat (see set_creds below)
 * so the httpd response for the /wifi/connect request that triggered this
 * can flush over the very link we're about to drop — otherwise the client
 * gets a connection reset instead of the redirect (observed on hardware:
 * esp_wifi_disconnect() tears down the TCP session serving that request). */
static void wifi_apply_reconfigure_task(void *)
{
    vTaskDelay(pdMS_TO_TICKS(300));

    ESP_LOGI(TAG, "Wi-Fi reconfigure: SSID -> \"%s\"", s_wifi_ssid);
    s_wifi_recfg_until_us = esp_timer_get_time() + 15LL * 1000000;   /* safety net */
    s_wifi_reconfiguring  = true;
    esp_wifi_disconnect();

    wifi_config_t wifi_cfg = {};
    strlcpy(reinterpret_cast<char *>(wifi_cfg.sta.ssid),
            s_wifi_ssid, sizeof(wifi_cfg.sta.ssid));
    strlcpy(reinterpret_cast<char *>(wifi_cfg.sta.password),
            s_wifi_pass, sizeof(wifi_cfg.sta.password));
    wifi_cfg.sta.threshold.authmode = WIFI_AUTH_WPA2_PSK;
    esp_wifi_set_config(WIFI_IF_STA, &wifi_cfg);

    /* Flag stays set until WIFI_EVENT_STA_CONNECTED clears it (or the deadline
     * expires), so the async disconnect event can't slip past it — see
     * wifi_reconfig_active. */
    esp_wifi_connect();
    vTaskDelete(nullptr);
}

/* Reconfigure to a new SSID/password: persist to NVS and update the in-memory
 * copy synchronously (so it and the web UI agree immediately), then hand the
 * disruptive part (disconnect/reconnect) to a deferred one-shot task. */
extern "C" bool dns_sink_wifi_set_creds(const char *ssid, const char *pass)
{
    if (!ssid || ssid[0] == '\0' || strlen(ssid) >= sizeof(s_wifi_ssid)) return false;
    if (pass && strlen(pass) >= sizeof(s_wifi_pass)) return false;

    snprintf(s_wifi_ssid, sizeof(s_wifi_ssid), "%s", ssid);
    snprintf(s_wifi_pass, sizeof(s_wifi_pass), "%s", pass ? pass : "");

    nvs_handle_t h;
    if (nvs_open(NVS_NS, NVS_READWRITE, &h) == ESP_OK) {
        nvs_set_str(h, "wifi_ssid", s_wifi_ssid);
        nvs_set_str(h, "wifi_pass", s_wifi_pass);
        nvs_commit(h);
        nvs_close(h);
    }

    xTaskCreate(wifi_apply_reconfigure_task, "wifi_recfg", 3072, nullptr, 3, nullptr);
    return true;
}
#else
extern "C" void dns_sink_wifi_get_ssid(char *out, size_t cap) { if (cap) out[0] = '\0'; }
extern "C" bool dns_sink_wifi_scan_start(void) { return false; }
extern "C" int  dns_sink_wifi_scan_get(char *out, size_t cap)
{
    return snprintf(out, cap, "{\"state\":\"idle\",\"age_s\":-1,\"aps\":[]}");
}
extern "C" bool dns_sink_wifi_set_creds(const char *, const char *) { return false; }
#endif

