GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
    s_eth_eg = xEventGroupCreate();

    ESP_ERROR_CHECK(esp_event_handler_register(IP_EVENT, ESP_EVENT_ANY_ID,
                                               ip_event_handler, nullptr));

    /* Register Ethernet event handler */
    ESP_ERROR_CHECK(esp_event_handler_register(ETH_EVENT, ESP_EVENT_ANY_ID,
                                               eth_event_handler, nullptr));

    /* Init W5500 + create default Ethernet netif (DHCP client). Always brought
     * up — the L2 fast-path and LAN-facing IP (mDNS, router DNS target, web UI)
     * live here regardless of whether Wi-Fi is also enabled. */
    esp_eth_handle_t eth_handle = eth_init_w5500();
    esp_netif_config_t netif_cfg = ESP_NETIF_DEFAULT_ETH();
    esp_netif_t *eth_netif = esp_netif_new(&netif_cfg);
    esp_netif_attach(eth_netif, esp_eth_new_netif_glue(eth_handle));
    /* Override the glue's input with our L2 fast-path hook (passthrough for now) */
    ESP_ERROR_CHECK(esp_eth_update_input_path_info(eth_handle, l2_input_cb, eth_netif));

    /* Static IP (#55): the netif has to be configured before the driver starts
     * (see apply_static_ip), but the address is only *published* once the link
     * actually comes up — publish_static_eth, from the event handler (#56). */
    netcfg_load("eth", &s_eth_static);
    if (!s_eth_static.dhcp)
        apply_static_ip(eth_netif, s_eth_static);
    ESP_ERROR_CHECK(esp_eth_start(eth_handle));

#if CONFIG_ADBLOCK_NET_WIFI
    /* Wi-Fi STA bring-up alongside Ethernet (#53: dual-WAN). No L2 fast-path
     * here — Wi-Fi queries take the normal lwIP socket path. */
    wifi_init_sta();

    /* Wait for EITHER interface, not both — the Ethernet cable may not be
     * plugged in at all (Wi-Fi-only operation is a supported mode, not just
     * a transient boot state), so blocking on both would hang forever with
     * no cable connected. Whichever interface comes up later still fires its
     * own IP_EVENT and joins in (apply_upstream_iface() re-runs each time). */
    ESP_LOGI(TAG, "Waiting for Ethernet or Wi-Fi link and DHCP...");
    xEventGroupWaitBits(s_eth_eg, ETH_GOT_IP_BIT | WIFI_GOT_IP_BIT,
                        pdFALSE, pdFALSE, portMAX_DELAY);
    ESP_LOGI(TAG, "Network ready — Ethernet: %s  Wi-Fi: %s",
             s_ip[0] ? s_ip : "(down)", s_wifi_ip[0] ? s_wifi_ip : "(down)");
#else
    /* Wait for link + DHCP lease */
    ESP_LOGI(TAG, "Waiting for Ethernet link and DHCP...");
    xEventGroupWaitBits(s_eth_eg, ETH_CONNECTED_BIT | ETH_GOT_IP_BIT,
                        pdFALSE, pdTRUE, portMAX_DELAY);
    ESP_LOGI(TAG, "Network ready — IP: %s", s_ip);
#endif

    upstream_iface_init_nvs();

    /* (raw W5500 TX floor measured at ~400us/frame, 2497fps — bus has ~5x
     *  headroom over our ~527qps; the gap is the lwIP per-query path.) */

    /* Allocate PSRAM ping-pong buffers */
    if (!blocklist_init()) {
        ESP_LOGE(TAG, "PSRAM blocklist init failed — halting");
        for (;;) vTaskDelay(portMAX_DELAY);
    }
    rewrite_init();
    dot_init_nvs();
    acl_init();
    query_log_init();

    /* Mount SD card (SPI3 — separate bus from W5500) */
    sd_mount();

    /* Start DNS sinkhole (Core 1, priority 10). Upstream = the DHCP-provided
     * DNS server for whichever interface is selected (see pick_upstream /
     * apply_upstream_iface — #53). Switchable live from the web UI afterwards
     * without restarting this task. */
    const char *upstream = pick_upstream(s_eth_dns, s_gw);
#if CONFIG_ADBLOCK_NET_WIFI
    if (strcmp(s_upstream_iface, "wifi") == 0)
        upstream = pick_upstream(s_wifi_dns, s_wifi_gw);
#endif
    if (!s_dns.start(upstream)) {
        ESP_LOGE(TAG, "DNS server start failed — halting");
        for (;;) vTaskDelay(portMAX_DELAY);
    }
    {
        const char *lan_ip = s_ip[0] ? s_ip :
#if CONFIG_ADBLOCK_NET_WIFI
                              s_wifi_ip;
#else
                              "(no IP yet)";
#endif
        ESP_LOGI(TAG, "DNS sinkhole active (upstream via %s: %s). Point your router's DNS at %s",
                 s_upstream_iface, upstream, lan_ip);
    }

    /* Start web UI on port 80 */
    web_ui_start(&s_dns);

    /* SNTP: get real wall-clock time so the query log carries dated timestamps.
     * Lightweight built-in lwIP SNTP (one UDP socket). Resolves via the board's
     * own DHCP DNS, not our sinkhole, so it works even before the blocklist loads. */
    timesync_start();

    /* mDNS: advertise as esp32adblock.local and expose the HTTP service (#20) */
    if (mdns_init() == ESP_OK) {
        mdns_hostname_set("esp32adblock");
        mdns_instance_name_set("ESP32 AdBlocker");
        mdns_service_add(nullptr, "_http", "_tcp", 80, nullptr, 0);
        ESP_LOGI(TAG, "mDNS: reachable at esp32adblock.local");
    }

    /* Launch blocklist download + daily reload (Core 0, priority 2).
     * 24KB stack: mbedTLS (HTTPS fetch) + FATFS (SD save) are both deep. */
    xTaskCreatePinnedToCore(download_task, "bl_download", 24576, nullptr, 2, nullptr, 0);

    /* USB recovery console: rescue a headless board over the flash cable. */
    console_start();

    ESP_LOGI(TAG, "Startup complete. Ethernet: %s  Wi-Fi: %s — either can be set as your DNS server.",
             s_ip[0] ? s_ip : "(down)",
#if CONFIG_ADBLOCK_NET_WIFI
             s_wifi_ip[0] ? s_wifi_ip : "(down)");
#else
             "(not built)");
#endif
}
